; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	satellite4 - satellite
	instrument4 - instrument
	infrared3 - mode
	spectrograph4 - mode
	image2 - mode
	image1 - mode
	thermograph0 - mode
	Star2 - direction
	Star4 - direction
	GroundStation3 - direction
	Star5 - direction
	GroundStation0 - direction
	Star1 - direction
	GroundStation6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(supports instrument0 image1)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument1 spectrograph4)
	(supports instrument1 image1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet12)
	(supports instrument2 image1)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 Star5)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star1)
	(supports instrument3 thermograph0)
	(supports instrument3 infrared3)
	(calibration_target instrument3 Star1)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star2)
	(supports instrument4 image1)
	(supports instrument4 spectrograph4)
	(supports instrument4 image2)
	(calibration_target instrument4 GroundStation6)
	(on_board instrument4 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet13)
)
(:goal (and
	(pointing satellite0 Star5)
	(pointing satellite2 Star10)
	(have_image Phenomenon7 image2)
	(have_image Star8 spectrograph4)
	(have_image Phenomenon9 spectrograph4)
	(have_image Star10 image1)
	(have_image Planet11 image2)
	(have_image Planet12 image2)
	(have_image Planet13 thermograph0)
))

)

; plan
1. (turn_to satellite2 groundstation0 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 groundstation0)
   goals met: 0 of 9
2. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 9
3. (calibrate satellite2 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 0 of 9
4. (turn_to satellite2 planet11 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 planet11)
   goals met: 0 of 9
5. (take_image satellite2 planet11 instrument2 image2)
   added: (have_image planet11 image2)
   goals met: 1 of 9
6. (turn_to satellite2 phenomenon7 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 phenomenon7)
   goals met: 1 of 9
7. (turn_to satellite1 groundstation3 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 groundstation3)
   goals met: 1 of 9
8. (take_image satellite2 phenomenon7 instrument2 image2)
   added: (have_image phenomenon7 image2)
   goals met: 2 of 9
9. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 2 of 9
10. (calibrate satellite1 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 2 of 9
11. (turn_to satellite0 star5 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star5)
   goals met: 3 of 9
12. (turn_to satellite1 phenomenon9 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 phenomenon9)
   goals met: 3 of 9
13. (take_image satellite1 phenomenon9 instrument1 spectrograph4)
   added: (have_image phenomenon9 spectrograph4)
   goals met: 4 of 9
14. (turn_to satellite1 planet13 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet13)
   goals met: 4 of 9
15. (take_image satellite1 planet13 instrument1 thermograph0)
   added: (have_image planet13 thermograph0)
   goals met: 5 of 9
16. (turn_to satellite1 star8 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 star8)
   goals met: 5 of 9
17. (take_image satellite1 star8 instrument1 spectrograph4)
   added: (have_image star8 spectrograph4)
   goals met: 6 of 9
18. (turn_to satellite2 planet12 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 planet12)
   goals met: 6 of 9
19. (take_image satellite2 planet12 instrument2 image2)
   added: (have_image planet12 image2)
   goals met: 7 of 9
20. (turn_to satellite2 star10 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 star10)
   goals met: 8 of 9
21. (take_image satellite2 star10 instrument2 image1)
   added: (have_image star10 image1)
   goals met: 9 of 9
